using System;

namespace _1
{
    class Program
    {
       
        static void Main(string[] args)
        {
           string[] days = new string[31]{
            "Первое",
            "Второе",
           "Третье",
           "Четвертое",
           "Пятое",
            "Шестое",
           "Седьмое",
           "Восьмое",
            "Девятое",
            "Десятое",
            "Одиннадцатое",
            "Двеннадцатое",
           "Триннадцатое",
            "Четырнадцатое",
            "Пятнадцатое",
            "Шестнадцатое",
            "Семнадцатое",
            "Восемнадцатое",
            "Девятнадцатое",
            "Двадцатое",
            "Двадцатьпервое",
            "Двадцатьвторое",
            "Двадцатьтретье",
            "Двадцатьчетвёртое",
            "Двадцатьпятое",
            "Двадцатьшестое",
            "Двадцатьседьмое",
            "Двадцатьвосьмое",
            "Двадцатьдевятое",
            "Тридцатое",
            "Тридцатьпервое"};
           string[] mo = new string[12]{ "января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября", "декабря" };
           Console.Write("Введите номер дня : ");
           int D = Convert.ToInt32(Console.ReadLine());
           Console.Write("Введите номер месяца: ");
           int M = Convert.ToInt32(Console.ReadLine());
            Console.WriteLine($"{days[D - 1]} {mo[M - 1]}");
        }
    }
}
